model {
  ssd {
    num_classes: 4
    image_resizer {
      fixed_shape_resizer {
        height: 300
        width: 510
      }
    }
    feature_extractor {
      type: "ssd_squeezenet_v11"
      depth_multiplier: 1.0
      min_depth: 16
      conv_hyperparams {
        regularizer {
          l2_regularizer {
            weight: 5e-4
          }
        }
        initializer {
          truncated_normal_initializer {
            mean: 0.0
            stddev: 0.0299999993294
          }
        }
        activation: RELU_6
        batch_norm {
          decay: 0.999700009823
          center: true
          scale: true
          epsilon: 0.0010000000475
          train: true
        }
      }
    }
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    box_predictor {
      convolutional_box_predictor {
        conv_hyperparams {
          regularizer {
            l2_regularizer {
              weight: 3.99999989895e-05
            }
          }
          initializer {
            truncated_normal_initializer {
              mean: 0.0
              stddev: 0.0299999993294
            }
          }
          activation: RELU_6
          batch_norm {
            decay: 0.999700009823
            center: true
            scale: true
            epsilon: 0.0010000000475
            train: true
          }
        }
        min_depth: 0
        max_depth: 0
        num_layers_before_predictor: 0
        use_dropout: false
        dropout_keep_probability: 0.800000011921
        kernel_size: 1
        box_code_size: 4
        apply_sigmoid_to_scores: false
      }
    }
    anchor_generator {
      ssd_anchor_generator {
        num_layers: 6
        min_scale: 0.05
        max_scale: 0.6
        aspect_ratios: 1.0
      }
    }
    post_processing {
      batch_non_max_suppression {
        score_threshold: 0.01
        iou_threshold: 0.45
        max_detections_per_class: 40
        max_total_detections: 100
      }
      score_converter: SIGMOID
    }
    normalize_loss_by_num_matches: true
    loss {
      localization_loss {
        weighted_smooth_l1 {
        }
      }
      classification_loss {
        weighted_sigmoid {
        }
      }
      hard_example_miner {
        num_hard_examples: 3000
        iou_threshold: 0.990000009537
        loss_type: CLASSIFICATION
        max_negatives_per_positive: 3
        min_negatives_per_image: 0
      }
      classification_weight: 1.0
      localization_weight: 1.0
    }
  }
}
train_config {
  batch_size: 16
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  data_augmentation_options {
    ssd_random_crop {
    }
  }
  optimizer {
    momentum_optimizer: {
      learning_rate: {
        manual_step_learning_rate {
          initial_learning_rate: 0.0003
          schedule {
            step: 20000
            learning_rate: 0.0001
          }
          schedule {
            step: 50000
            learning_rate: 0.00003
          }
          schedule {
            step: 100000
            learning_rate: 0.00001
          }
        }
      }
      momentum_optimizer_value: 0.9
    }
  }
  ### Replace with your own path
  # fine_tune_checkpoint: "/home/zhongyilin/Documents/TrafficSignBench/Detection/models/research/object_detection/trained_models/gtsdb_ssd_squeezenet_v11/train_logs/model.ckpt-5396"
  # from_detection_checkpoint: true
  num_steps: 180000
}
train_input_reader {
  ### Replace with your own path
  label_map_path: "/home/zhongyilin/Documents/TrafficSignBench/Detection/models/research/object_detection/data/gtsdb_label_map.pbtxt"
  tf_record_input_reader {
    ### Replace with your own path
    input_path: "/home/zhongyilin/Documents/data/GTSDBdevkit/tfrecords/train-?????-of-00016"
  }
}
eval_config {
  num_examples: 153
  max_evals: 1
  use_moving_averages: false
}
eval_input_reader {
  ### Replace with your own path
  label_map_path: "/home/zhongyilin/Documents/TrafficSignBench/Detection/models/research/object_detection/data/gtsdb_label_map.pbtxt"
  shuffle: false
  num_readers: 1
  tf_record_input_reader {
    ### Replace with your own path
    input_path: "/home/zhongyilin/Documents/data/GTSDBdevkit/tfrecords/val-?????-of-00016"
  }
}
