model {
  ssd {
    num_classes: 4
    image_resizer {
      fixed_shape_resizer {
        height: 300
        width: 510
      }
    }
    feature_extractor {
      type: "ssd_mobilenet_v2"
      depth_multiplier: 1.0
      min_depth: 16
      conv_hyperparams {
        regularizer {
          l2_regularizer {
            weight: 3.9999998989515007e-05
          }
        }
        initializer {
          truncated_normal_initializer {
            mean: 0.0
            stddev: 0.029999999329447746
          }
        }
        activation: RELU_6
        batch_norm {
          decay: 0.9997000098228455
          center: true
          scale: true
          epsilon: 0.0010000000474974513
          train: true
        }
      }
      use_depthwise: true
    }
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    box_predictor {
      convolutional_box_predictor {
        conv_hyperparams {
          regularizer {
            l2_regularizer {
              weight: 3.9999998989515007e-05
            }
          }
          initializer {
            truncated_normal_initializer {
              mean: 0.0
              stddev: 0.029999999329447746
            }
          }
          activation: RELU_6
          batch_norm {
            decay: 0.9997000098228455
            center: true
            scale: true
            epsilon: 0.0010000000474974513
            train: true
          }
        }
        min_depth: 0
        max_depth: 0
        num_layers_before_predictor: 0
        use_dropout: false
        dropout_keep_probability: 0.800000011920929
        kernel_size: 3
        box_code_size: 4
        apply_sigmoid_to_scores: false
        use_depthwise: true
      }
    }
    anchor_generator {
      ssd_anchor_generator {
        num_layers: 6
        min_scale: 0.05000000074505806
        max_scale: 0.6000000238418579
        aspect_ratios: 1.0
      }
    }
    post_processing {
      batch_non_max_suppression {
        score_threshold: 0.009999999776482582
        iou_threshold: 0.44999998807907104
        max_detections_per_class: 100
        max_total_detections: 100
      }
      score_converter: SIGMOID
    }
    normalize_loss_by_num_matches: true
    loss {
      localization_loss {
        weighted_smooth_l1 {
        }
      }
      classification_loss {
        weighted_sigmoid {
        }
      }
      hard_example_miner {
        num_hard_examples: 3000
        iou_threshold: 0.9900000095367432
        loss_type: CLASSIFICATION
        max_negatives_per_positive: 3
        min_negatives_per_image: 3
      }
      classification_weight: 1.0
      localization_weight: 1.0
    }
  }
}
train_config {
  batch_size: 2
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  data_augmentation_options {
    ssd_random_crop {
    }
  }
  optimizer {
    rms_prop_optimizer {
      learning_rate {
        manual_step_learning_rate {
          initial_learning_rate: 9.999999747378752e-05
          schedule {
            step: 20000
            learning_rate: 1.9999999494757503e-05
          }
          schedule {
            step: 40000
            learning_rate: 3.999999989900971e-06
          }
          schedule {
            step: 100000
            learning_rate: 8.000000093488779e-07
          }
        }
      }
      momentum_optimizer_value: 0.8999999761581421
      decay: 0.8999999761581421
      epsilon: 1.0
    }
  }
  ### Replace with your own path
  fine_tune_checkpoint: "/home/zhongyilin/Documents/TrafficSignBench/Detection/models/research/object_detection/trained_models/gtsdb_ssdlite_mobilenet_v2/train_logs/model.ckpt-200000"
  from_detection_checkpoint: true
  num_steps: 200000
}
train_input_reader {
  ### Replace with your own path
  label_map_path: "/home/zhongyilin/Documents/TrafficSignBench/Detection/models/research/object_detection/data/gtsdb_label_map.pbtxt"
  tf_record_input_reader {
    ### Replace with your own path
    input_path: "/home/zhongyilin/Documents/data/GTSDBdevkit/tfrecords/val-?????-of-00016"
  }
}
eval_config {
  num_examples: 153
  max_evals: 1
  use_moving_averages: false
}
eval_input_reader {
  ### Replace with your own path
  label_map_path: "/home/zhongyilin/Documents/TrafficSignBench/Detection/models/research/object_detection/data/gtsdb_label_map.pbtxt"
  shuffle: false
  num_readers: 1
  tf_record_input_reader {
    ### Replace with your own path
    input_path: "/home/zhongyilin/Documents/data/GTSDBdevkit/tfrecords/val-?????-of-00016"
  }
}
